{
  "resourceType": "CodeSystem",
  "id": "THREEMAPDRG",
  "text": {
    "status": "generated",
    "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\"><p>This code system http://terminology.hl7.org/temporary-uri/codeSystem/APDRG defines many codes, but they are not represented here</p></div>"
  },
  "url": "http://terminology.hl7.org/temporary-uri/codeSystem/APDRG",
  "version": "0.1.10",
  "name": "THREEMAPDRG",
  "title": "All Patient Diagnosis Related Groups (APR-DRGs)",
  "status": "active",
  "date": "2020-11-11T14:20:39+00:00",
  "publisher": "HL7 Financial Management Working Group",
  "contact": [
    {
      "name": "HL7 Financial Management Working Group",
      "telecom": [
        {
          "system": "url",
          "value": "http://www.hl7.org/Special/committees/fm/index.cfm"
        },
        {
          "system": "email",
          "value": "fm@lists.HL7.org"
        }
      ]
    }
  ],
  "description": "In 1987, the state of New York passed legislation instituting a DRG-based prospective payment system for all non-Medicare patients. The legislation included a requirement that the New York State Department of Health (NYDH) evaluate the applicability of the DRGs to a non-Medicare population. In particular, the legislation required that the DRGs be evaluated with respect to neonates and patients with Human Immunodeficiency Virus (HIV) infections. NYDH entered into an agreement with 3M HIS to assist with the evaluation of the need for DRG modifications as well as to make the necessary changes in the DRG definitions and software. The DRG definitions developed by NYDH and 3M HIS are referred to as the All Patient DRGs (AP-DRGs).\n\nAs the AP-DRG code system is no longer in use and little authoratative information is available, the following resources have been used to compile the documented information\n\n[https://www.hcup-us.ahrq.gov/db/nation/nis/APR-DRGsV20MethodologyOverviewandBibliography.pdf](https://www.hcup-us.ahrq.gov/db/nation/nis/APR-DRGsV20MethodologyOverviewandBibliography.pdf)\n\n_**Note: A temporary URL has been defined for this codesystem for use in draft implementation guides. It should be noted that the authoritative canonical URL will be different.**_",
  "jurisdiction": [
    {
      "coding": [
        {
          "system": "urn:iso:std:iso:3166",
          "code": "US"
        }
      ]
    }
  ],
  "copyright": "Use of AP-DRGs require a license.  Reference https://www.3m.com/3M/en_US/health-information-systems-us/drive-value-based-care/patient-classification-methodologies/apr-drgs/.   As HL7 is working with the owning authorities to finalize the urls, the urls are subject to change.",
  "content": "not-present"
}